# To use:
#   brew tap homebrew/bundle
#   brew bundle

# Prerequisites
brew "mas"
# cask "setapp"

# Basic Shell Setup
brew "bat"
brew "exa"
brew "fd"
brew "starship"
brew "tmux"
brew "zsh"
brew "zplug"
brew "moreutils"

# Editing
brew "fzf"
brew "neovim"
brew "ripgrep"

# Developer Tooling
brew "asdf"
brew "direnv"
brew "up"

## For asdf-erlang (including observer, doc-building)
brew "autoconf"
brew "wxwidgets"
brew "libxslt"
brew "fop"
brew "git"
brew "git-revise"
brew "gh"

cask "iterm2"
cask "kaleidoscope"
#cask "tower"
# tap "universal-ctags/universal-ctags"
# brew "universal-ctags", args: ["HEAD"]
# brew "rust-analyzer", args: ["ignore-dependencies"]


# Productivity
cask "slack"
cask "camo-studio"

## Videoconferencing
cask "homebrew/cask-drivers/elgato-control-center"
cask "zoom"

# MAS
mas "DaisyDisk", id: 411643860
mas "Patterns", id: 429449079
#mas "Scenecuts Helper", id: 1540491573
mas "Tot", id: 1491071483
# mas "Velja", id: ??
