# To use:
#   brew tap homebrew/bundle
#   brew bundle

# Prerequisites
brew "mas"
# cask "setapp"

# Basic Shell Setup
brew "bat"
brew "exa"
brew "fd"
brew "starship"
brew "tmux"
brew "zsh"
brew "zplug"
brew "moreutils"

# Editing
brew "fzf"
brew "neovim"
brew "ripgrep"

# Developer Tooling
brew "asdf"
## For asdf-nodejs
brew "gawk"
brew "git"
brew "git-revise"
brew "gh"
cask "iterm2"
cask "kaleidoscope"
cask "tower"
# tap "universal-ctags/universal-ctags"
# brew "universal-ctags", args: ["HEAD"]
# brew "rust-analyzer", args: ["ignore-dependencies"]
brew "up"

# Security
brew "gpg"
brew "pinentry-mac"

# Productivity
cask "slack"
cask "camo-studio"


## Videoconferencing
cask "homebrew/cask-drivers/elgato-control-center"
cask "zoom"

# MAS
mas "DaisyDisk", id: 411643860
mas "Deliveries", id: 924726344
mas "Patterns", id: 429449079
mas "Scenecuts Helper", id: 1540491573
mas "Shush", id: 496437906
mas "Tab Space", id: 1473726602
mas "Tot", id: 1491071483
mas "Wimoweh", id: 610341008

