# To use:
#   brew tap homebrew/bundle
#   brew bundle

# Prerequisites
brew "mas"
cask "setapp"

# Basic Shell Setup
brew "bat"
cask "kitty"
brew "stow"
brew "tmux"
brew "zsh"

# Editing
brew "fzf"
brew "ripgrep"

# Developer Tooling
brew "asdf"
cask "aws-vault"
cask "dash"
brew "docker-completion"
brew "git"
cask "gitkraken"
brew "git-revise"
brew "gh"
cask "kaleidoscope"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
tap "universal-ctags/universal-ctags"
brew "universal-ctags" args: ["HEAD"]

# Productivity
cask "droplr"
cask "fantastical"
cask "omnifocus"
cask "rocket"

# MAS
mas "Bear", id: 1091189122
mas "DaisyDisk", id: 411643860
mas "Deliveries", id: 924726344
mas "Patterns", id: 429449079
mas "Shush", id: 496437906
mas "Slack", id: 803453959
