# Don't run this directly, instead run Brewfile-home or Brewfile-work

# Meta
brew "mas"
cask "setapp"

# Browsers
cask "arc" ## This fails if arc is already installed.

# CLI
brew "eza" # Maintained fork of exa
brew "fd" # Find replacement
brew "fzf"
brew "ripgrep"
cask "ghostty"
brew "starship"

# Communications
cask "elgato-stream-deck"
cask "elgato-control-center"
mas "Slack", id: 803453959
cask "unclack"

# Development
brew "direnv"
brew "gh"
brew "jj"
brew "shellcheck"
cask "tower"
cask "zed"

## asdf-vm
brew "coreutils"
brew "curl"
brew "git"
brew "asdf"

# Device Support
cask "keymapp"
cask "usb-overdrive"

# Notes
cask "obsidian"
mas "Tot", id: 1491071483

# Productivity
cask "omnifocus"

# Security
mas "Yubico Authenticator", id: 1497506650
