# Don't run this directly, instead run Brewfile-home or Brewfile-work

# Meta
brew "mas"

# Browsers
# cask "arc" ## This fails if arc is already installed.

# CLI
brew "eza" # Maintained fork of exa
brew "fd" # Find replacement
brew "fzf"
brew "ripgrep"
cask "ghostty"
brew "starship"

# Communications
mas "Slack", id: 803453959
mas "Mic Drop", id: 1489816366


# Development
brew "gh"
brew "jj"
brew "mise"
brew "shellcheck"
cask "zed"

# Notes
cask "obsidian"
mas "Tot", id: 1491071483

# Security
mas "Yubico Authenticator", id: 1497506650
