# Don't run this directly, instead run Brewfile-home or Brewfile-work

# Meta
brew "mas"
cask "setapp"

# Browsers
cask "arc"

# CLI
brew "eza" # Maintained fork of exa
brew "ripgrep"
cask "warp"

# Communications
cask "elgato-stream-deck"
cask "elgato-control-center"
mas "Slack", id: 803453959

# Development
brew "gh"
brew "shellcheck"
cask "tower"
cask "zed"

## asdf-vm
brew "coreutils"
brew "curl"
brew "git"
brew "asdf"

# Notes
cask "obsidian"
mas "Tot", id: 1491071483

# Security
mas "Yubico Authenticator", id: 1497506650
